[
    {
        "iIndex": 0,
        "lAlignments": [
            80,
            120,
            136
        ],
        "lEquations": [
            "X=((32.0+42.0)-35.0)"
        ],
        "lSolutions": [
            39.0
        ],
        "sQuestion": " For Halloween Debby and her sister combined the candy they received. Debby had 32 pieces of candy while her sister had 42. If they ate 35 pieces the first night, how many pieces do they have left? "
    },
    {
        "iIndex": 1,
        "lAlignments": [
            17,
            37,
            75
        ],
        "lEquations": [
            "X=((13.0+5.0)-10.0)"
        ],
        "lSolutions": [
            8.0
        ],
        "sQuestion": " A pet store had 13 siamese cats and 5 house cats. During a sale they sold 10 cats. How many cats do they have left? "
    },
    {
        "iIndex": 2,
        "lAlignments": [
            58,
            91,
            119
        ],
        "lEquations": [
            "X=((2.0+2.0)-2.0)"
        ],
        "lSolutions": [
            2.0
        ],
        "sQuestion": " Luke was trying to expand his game collection. He bought 2 games from a friend and bought 2 more at a garage sale. If 2 of the games didn't work, how many good games did he end up with? "
    },
    {
        "iIndex": 3,
        "lAlignments": [
            30,
            48,
            98
        ],
        "lEquations": [
            "X=((42.0+7.0)-9.0)"
        ],
        "lSolutions": [
            40.0
        ],
        "sQuestion": " The school cafeteria ordered 42 red apples and 7 green apples for students lunches. But, if only 9 students wanted fruit, how many extra did the cafeteria end up with? "
    },
    {
        "iIndex": 4,
        "lAlignments": [
            13,
            27,
            78
        ],
        "lEquations": [
            "X=((36.0+37.0)-70.0)"
        ],
        "lSolutions": [
            3.0
        ],
        "sQuestion": " Lana picked 36 tulips and 37 roses to make flower bouquets. If she only used 70 of the flowers though, how many extra flowers did Lana pick? "
    },
    {
        "iIndex": 5,
        "lAlignments": [
            72,
            97,
            109
        ],
        "lEquations": [
            "X=((29.0+16.0)-38.0)"
        ],
        "lSolutions": [
            7.0
        ],
        "sQuestion": " Carol and her mom were picking carrots from their garden. Carol picked 29 and her mother picked 16. If only 38 of the carrots were good, how many bad carrots did they have? "
    },
    {
        "iIndex": 6,
        "lAlignments": [
            11,
            47,
            73
        ],
        "lEquations": [
            "X=((16.0+28.0)-25.0)"
        ],
        "lSolutions": [
            19.0
        ],
        "sQuestion": " Roger had 16 dollars. For his birthday he got 28 more dollars but spent 25 on a new game. How much money does he have now? "
    },
    {
        "iIndex": 7,
        "lAlignments": [
            31,
            58,
            97
        ],
        "lEquations": [
            "X=((15.0+18.0)-31.0)"
        ],
        "lSolutions": [
            2.0
        ],
        "sQuestion": " While on vacation, Megan took 15 pictures at the zoo and 18 at the museum. If she later deleted 31 of the pictures, how many pictures from her vacation did she still have? "
    },
    {
        "iIndex": 8,
        "lAlignments": [
            43,
            73,
            116
        ],
        "lEquations": [
            "X=((23.0+32.0)-44.0)"
        ],
        "lSolutions": [
            11.0
        ],
        "sQuestion": " Rachel bought two coloring books. One had 23 pictures and the other had 32. After one week she had already colored 44 of the pictures. How many pictures does she still have to color? "
    },
    {
        "iIndex": 9,
        "lAlignments": [
            17,
            43,
            102
        ],
        "lEquations": [
            "X=((9.0+21.0)-29.0)"
        ],
        "lSolutions": [
            1.0
        ],
        "sQuestion": " Ned had to wash 9 short sleeve shirts and 21 long sleeve shirts before school. If he had only washed 29 of them by the time school started, how many did he not wash? "
    }
]