[
    {
        "lEquations": [
            "70-x=27"
        ],
        "lSolutions": [
            43.0
        ],
        "grammarCheck": 0,
        "templateNumber": 0,
        "sQuestion": "Joan found 70 seashells on the beach. she gave Sam some of her seashells. She has 27 seashell left. How many seashells did she give to Sam ?",
        "iIndex": 0
    },
    {
        "lEquations": [
            "28+x=54"
        ],
        "lSolutions": [
            26.0
        ],
        "grammarCheck": 0,
        "templateNumber": 0,
        "sQuestion": "There were 28 bales of hay in the barn. Tim stacked more bales in the barn today. There are now 54 bales of hay in the barn. How many bales did he store in the barn ?",
        "iIndex": 1
    },
    {
        "lEquations": [
            "45*3=x"
        ],
        "lSolutions": [
            135.0
        ],
        "grammarCheck": 0,
        "templateNumber": 0,
        "sQuestion": "After eating at the restaurant, Sally, Sam, and Alyssa decided to divide the bill evenly. If each person paid 45 dollars, what was the total of the bill ?",
        "iIndex": 2
    },
    {
        "lEquations": [
            "8=2+x"
        ],
        "lSolutions": [
            6.0
        ],
        "grammarCheck": 0,
        "templateNumber": 0,
        "sQuestion": "Mary is baking a cake. The recipe wants 8 cups of flour. She already put in 2 cups. How many more cups does she need to add ?",
        "iIndex": 3
    },
    {
        "lEquations": [
            "12=x+4"
        ],
        "lSolutions": [
            8.0
        ],
        "grammarCheck": 0,
        "templateNumber": 0,
        "sQuestion": "Sara's high school played 12 basketball games this year. The team won most of their games. They were defeated during 4 games. How many games did they win ?",
        "iIndex": 4
    },
    {
        "lEquations": [
            "22+x=55"
        ],
        "lSolutions": [
            33.0
        ],
        "grammarCheck": 0,
        "templateNumber": 0,
        "sQuestion": "There are 22 walnut trees currently in the park. Park workers will plant more walnut trees today. When the workers are finished there will be 55 walnut trees in the park. How many walnut trees did the workers plant today ?",
        "iIndex": 5
    },
    {
        "lEquations": [
            "34+x=86"
        ],
        "lSolutions": [
            52.0
        ],
        "grammarCheck": 0,
        "templateNumber": 0,
        "sQuestion": "Mike had 34 peaches left at his roadside fruit stand. He went to the orchard and picked more peaches to stock up the stand. There are now 86 peaches at the stand, how many did he pick ?",
        "iIndex": 6
    },
    {
        "lEquations": [
            "6+x=16"
        ],
        "lSolutions": [
            10.0
        ],
        "grammarCheck": 0,
        "templateNumber": 0,
        "sQuestion": "There were 6 roses in the vase. Mary cut some more roses from her flower garden. There are now 16 roses in the vase. How many roses did she cut ?",
        "iIndex": 7
    },
    {
        "lEquations": [
            "2+(5*x)=27"
        ],
        "lSolutions": [
            5.0
        ],
        "grammarCheck": 0,
        "templateNumber": 0,
        "sQuestion": "Benny bought a soft drink for 2 dollars and 5 candy bars. He spent a total of 27 dollars. How much did each candy bar cost ?",
        "iIndex": 8
    },
    {
        "lEquations": [
            "(x+4)/2=34"
        ],
        "lSolutions": [
            64.0
        ],
        "grammarCheck": 0,
        "templateNumber": 0,
        "sQuestion": "Benny bought 4 new baseball trading cards to add to his collection. The next day his dog ate half of his collection. There are now only 34 cards left. How many cards did Benny start with ?",
        "iIndex": 9
    }
]